{
    "name": "El Aamery Ilyas",
    "AboutMe": "About Me",
    "introText": "My name is Ilyas, I’m 19 years old, and I am a Computer Science student at the University of Lorraine. My journey in this field began in high school with Python, where I earned my diploma with honors. I then pursued a three-year Bachelor's degree in Computer Science (BUT Informatique), with the goal of continuing to a Master’s program after graduation. I created this portfolio to introduce myself to companies and showcase my work. Here, you will find all my projects, both academic and personal, with the option to view or download them. You can also learn more about me, my skills, and my background. Enjoy your visit!",
    "education": "Education",
    "education_bachelor": "Bachelor's in Computer Science - University of Lorraine (2024 - Present)",
    "education_baccalaureat": "High School Diploma in Computer Science, Maths and English - Lycée Hélène Boucher (2024)",
    "education_certificate": "Certificate of Proficiency in English - Cambridge English B2 (2024)",
    "Skills": "Skills",
    "skills_programming": "Programming (VS Code)",
    "skills_database": "Database Management",
    "skills_project_management": "Project Management",
    "skills_linux": "Linux Bash",
    "ProgrammingLanguages": "Programming Languages",
    "Projects": "Projects",
    "ContactMe": "Contact Me",
    "contactText": "If you would like to contact me or learn more, feel free to download my Curriculum below:",
    "download_cv": "Download my resume",
    "download_cv_ats": "Download my resume",
    "languages": "Languages",
    "french": "French - C2",
    "italian": "Italian - C2",
    "english": "English - B2",
    "arabic": "Arabic - B2",
    "jeux.zip":"If you want to try and analyze this program you can",
    "download-btn":"Download JeuX.zip",
    "download-btn3":"Download LogsConnexion.zip",
    "download-btn4":"Download PuebloZoo.zip",
    "download-btn5":"Download F1_2010.zip",
    "JeuX-description": "The project consists of creating a board game for two players, A and B, on a board with an odd number of rows and columns. Each player has tokens that he places on the board in an increasing manner, and the objective is to determine the winner by calculating the sum of the values ​​of the tokens surrounding the remaining free square. The player with the lowest sum wins, and a draw is possible if the sums are equal. The program must display and update the board after each move, displaying the tokens in the color corresponding to each player.",
    "JeuDeNim-description":"This project consists of developing a C program to play a grid game belonging to the Nim family of games. Two players, a human and a computer, compete on a grid of custom dimensions (between 5x5 and 30x30). The goal is to move a pawn from the initial square (1,1) to the 'well' located at the bottom right of the grid, respecting limited movements (to the right or down, by 1 or 2 squares). The player who drops the pawn into the well wins the game. The computer can play at different levels of difficulty, ranging from random movements (beginner level) to the use of a systematic winning strategy (virtuoso level). The winning strategy is based on the concept of nimber, an integer assigned to each square to determine favorable positions (zero or non-zero position). Thanks to this numbering, it is possible for a player to adopt an optimal strategy by seeking to place his opponent in a disadvantageous position. The program will have to manage the entry of the parameters of the game, ensure compliance with the rules of the game, and designate the winner at the end of the game.",
    "LogsConnexion-description":"This project, developed in Bash on Linux, allows for analyzing and tracking user access to a file. It consists of a set of scripts designed to enhance security by continuously monitoring user interactions with a specific file. When the script is executed, it records various details such as the username, host, IP address, device used, as well as the date and time of access. It then allows for data analysis to determine how many times a user has accessed the file per day, week, or month. Additionally, it is possible to display these statistics for a specific user or a group of users, along with all associated details. This project was my first university assignment in Bash.",
    "PuebloZoo-description":"PuebloZoo is a fictional yet fully functional database designed to manage the entire operational system of a zoo. I created it myself and tested it using various SQL queries, which yielded promising results for a student's first database project. My database skills are continuously improving, allowing me to avoid some of the mistakes I currently make. If you’d like to explore and test the database, you can download it via the ZIP link above the photo.",
    "F1-description":"As part of our first web development project at university, we had one month to create a responsive website on a topic of our choice. We were a group of four students and divided the tasks to build this site, which you can see here. We chose the 2010s Formula 1 as our theme. The website includes several pages: a homepage, a section on the history of Formula 1, a ranking table for the 2010 season, and dedicated pages for each driver, customized based on their team. To organize our work, we first created a wireframe to define the website’s design and then decided on our preferred workflow. The project went very smoothly, demonstrating our ability to manage ourselves and work autonomously as a team.",
    "Stage":"I am looking for an international internship for the period from 13/04 to 05/06/2026"
}

